ErrorChen/SensorArray/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_I2C_FREQ_HZ=350000
CONFIG_BOARD_I2C_AUTO_FALLBACK_ENABLE=y
CONFIG_BOARD_I2C_FALLBACK_LEVELS="350000,337500,325000,300000"
CONFIG_BOARD_I2C_PRIMARY_CLK_HZ_DEFAULT=350000
CONFIG_BOARD_I2C_SECONDARY_CLK_HZ_DEFAULT=350000
CONFIG_BOARD_I2C_RUNTIME_FALLBACK_ERROR_FRAMES=3
CONFIG_BOARD_I2C_PORT=0
CONFIG_BOARD_I2C_SDA_GPIO=9
CONFIG_BOARD_I2C_SCL_GPIO=10
CONFIG_BOARD_I2C0_FREQ_HZ=350000
CONFIG_BOARD_I2C1_ENABLE=y
CONFIG_BOARD_I2C1_PORT=1
CONFIG_BOARD_I2C1_SDA_GPIO=11
CONFIG_BOARD_I2C1_SCL_GPIO=12
CONFIG_BOARD_I2C1_FREQ_HZ=350000
CONFIG_SENSORARRAY_I2C_RECOVERY_ENABLED=y
CONFIG_SENSORARRAY_I2C_RECOVERY_COOLDOWN_MS=1000
CONFIG_SENSORARRAY_I2C_RECOVERY_MAX_FAILS=3
CONFIG_SENSORARRAY_I2C_RECOVERY_TOGGLE_CLOCKS=9
CONFIG_SENSORARRAY_FDC_MATRIX_TARGET_FPS=20
CONFIG_SENSORARRAY_FDC_MATRIX_PERIOD_MS=50
# CONFIG_SENSORARRAY_CAPTURE_FPS_LIMIT_ENABLE is not set
CONFIG_SENSORARRAY_FDC_MATRIX_SETTLE_US=1000
CONFIG_SENSORARRAY_FDC_MATRIX_DISCARD_SAMPLES=1
CONFIG_SENSORARRAY_FDC_DISCARD_FRAMES_AFTER_ROW_SWITCH=0
CONFIG_SENSORARRAY_FDC_ROW_EPOCH_RESTART_ENABLE=y
CONFIG_SENSORARRAY_FDC_ROW_EPOCH_RESTART_METHOD_SLEEP=y
CONFIG_SENSORARRAY_FDC_ROW_SWITCH_SETTLE_US=50
CONFIG_SENSORARRAY_FDC_PARALLEL_DUAL_BUS_READ=y
CONFIG_SENSORARRAY_FDC_INTB_ENABLE=y
CONFIG_SENSORARRAY_FDC_INTB_ACTIVE_LOW=y
CONFIG_SENSORARRAY_FDC_INTB1_GPIO=17
CONFIG_SENSORARRAY_FDC_INTB2_GPIO=18
# CONFIG_SENSORARRAY_FDC_INTB_TRIGGER_ANYEDGE is not set
CONFIG_SENSORARRAY_FDC_INTB_TRIGGER_FALLING_EDGE=y
CONFIG_SENSORARRAY_FDC_INTB_WAIT_TIMEOUT_US=10000
# CONFIG_SENSORARRAY_FDC_READY_POLICY_POLL_ONLY is not set
# CONFIG_SENSORARRAY_FDC_READY_POLICY_INTB_THEN_STATUS is not set
# CONFIG_SENSORARRAY_FDC_READY_POLICY_INTB_WITH_POLL_FALLBACK is not set
CONFIG_SENSORARRAY_FDC_READY_POLICY_INTB_STRICT_LEVEL=y
CONFIG_SENSORARRAY_FDC_DISABLE_READY_STATUS_POLL=y
CONFIG_SENSORARRAY_FDC_STATUS_AFTER_TIMEOUT_FALLBACK=y
CONFIG_SENSORARRAY_FDC_INTB_STATUS_CONFIRM_RETRY=1
CONFIG_SENSORARRAY_FDC_INTB_STATUS_CONFIRM_RETRY_US=100
# CONFIG_SENSORARRAY_FDC_INTB_FALLBACK_POLLING is not set
CONFIG_SENSORARRAY_FDC_INTB_WEAK_PULLUP=y
CONFIG_SENSORARRAY_FDC_READY_GUARD_US=3000
CONFIG_SENSORARRAY_FDC_STALE_UNREAD_DRAIN_ENABLE=y
CONFIG_SENSORARRAY_FDC_STALE_UNREAD_HARD_THRESHOLD=3
# CONFIG_SENSORARRAY_FDC_UNREAD_NO_DRDY_RESCUE_ENABLE is not set
# CONFIG_SENSORARRAY_FDC_DIAG_READ_UNREAD_FULL_WITHOUT_DRDY is not set
CONFIG_SENSORARRAY_FDC_READY_MAX_POLLS_AFTER_UNREAD_BEFORE_DRDY=3
CONFIG_SENSORARRAY_FDC_READY_POLL_INTERVAL_US=1000
CONFIG_SENSORARRAY_FDC_AFTER_INTB_RECHECK_ENABLE=y
CONFIG_SENSORARRAY_FDC_AFTER_INTB_RECHECK_MAX=1
CONFIG_SENSORARRAY_FDC_AFTER_INTB_RECHECK_INTERVAL_US=100
CONFIG_SENSORARRAY_FDC_AFTER_INTB_RECHECK_DEADLINE_US=1000
CONFIG_SENSORARRAY_FDC_ROW_DEVICE_RETRY_MAX=1
CONFIG_SENSORARRAY_FDC_ROW_DEVICE_WATCHDOG_MULTIPLIER=10
CONFIG_SENSORARRAY_FDC_ROW_DEVICE_WATCHDOG_OVERRIDE_US=0
CONFIG_SENSORARRAY_FDC_RECOVERY_RESET_ON_PROGRESS=y
CONFIG_SENSORARRAY_FDC_DIFF_CACHE_APPLY=y
# CONFIG_SENSORARRAY_FDC_CACHE_APPLY_VERBOSE_LOG is not set
CONFIG_SENSORARRAY_FDC_TEXT_OUTPUT_CAP_TOTAL_PF=y
# CONFIG_SENSORARRAY_FDC_TEXT_OUTPUT_BOTH_INLINE_DEBUG is not set
CONFIG_SENSORARRAY_LOG_FORMAT_COMPACT_KV=y
CONFIG_SENSORARRAY_LOG_OMIT_DEFAULT_FIELDS=y
CONFIG_SENSORARRAY_LOG_MASK_SHORT_FORM=y
CONFIG_SENSORARRAY_FDC_CAP_PRINT_DECIMALS=6
CONFIG_SENSORARRAY_FDC_ROW_LOG_LEVEL=1
CONFIG_SENSORARRAY_FDC_DEVICE_READ4_LOG_LEVEL=1
# CONFIG_SENSORARRAY_FDC_LOG_READY_EVERY_ROW is not set
# CONFIG_SENSORARRAY_FDC_LOG_ROW_PARALLEL_TIMING is not set
# CONFIG_SENSORARRAY_LOG_FRAME_OUTPUT_LEGACY is not set
CONFIG_SENSORARRAY_LOG_FRAME_SUMMARY_EVERY_N_FRAMES=50
CONFIG_SENSORARRAY_LOG_FRAME_SUMMARY_ON_ANOMALY=y
CONFIG_SENSORARRAY_ASYNC_LOG_ENABLE=y
# CONFIG_SENSORARRAY_ASYNC_LOG_LEGACY_SYNC_OUTPUT is not set
CONFIG_SENSORARRAY_ASYNC_LOG_FRAME_SLOTS=4
CONFIG_SENSORARRAY_ASYNC_LOG_EVENT_QUEUE_LEN=16
CONFIG_SENSORARRAY_USB_SINK_QUEUE_LEN=2
CONFIG_SENSORARRAY_USB_SINK_TASK_STACK=4096
CONFIG_SENSORARRAY_ASYNC_LOG_SUMMARY_EVERY_N_FRAMES=50
CONFIG_SENSORARRAY_ASYNC_LOG_TASK_STACK=16384
CONFIG_SENSORARRAY_ASYNC_LOG_TASK_PRIORITY=7
CONFIG_SENSORARRAY_ASYNC_LOG_TASK_CORE=0
CONFIG_SENSORARRAY_ASYNC_LOG_DROP_OLD_FRAMES=y
CONFIG_SENSORARRAY_SCAN_TASK_STACK=16384
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SENSORARRAY_FDC_RUNTIME_FAST_SWEEP_ENABLE=y
# CONFIG_SENSORARRAY_FDC_REAPPLY_CACHE_ON_WARNING is not set
CONFIG_SENSORARRAY_FDC_WARNING_REAPPLY_ONCE_PER_FINGERPRINT=y
CONFIG_SENSORARRAY_FDC_AMPLITUDE_FAST_SWEEP_THRESHOLD=4
CONFIG_SENSORARRAY_FDC_WARNING_REAPPLY_COOLDOWN_FRAMES=50
CONFIG_SENSORARRAY_FDC_WARNING_FAST_SWEEP_COOLDOWN_MS=1000
CONFIG_SENSORARRAY_FDC_FULL_RESCUE_COOLDOWN_MS=3000
CONFIG_SENSORARRAY_FDC_ALL_INVALID_RESCUE_THRESHOLD=3
CONFIG_SENSORARRAY_REQUIRE_DUAL_FDC_FOR_BOOT=y
CONFIG_SENSORARRAY_FDC_ALL_INVALID_FULL_SWEEP_THRESHOLD=3
CONFIG_SENSORARRAY_FDC_FULL_SWEEP_REQUEST_COOLDOWN_MS=5000
CONFIG_SENSORARRAY_FDC_MAX_CONSECUTIVE_FULL_SWEEP_FAILS=3
CONFIG_SENSORARRAY_FDC_CELL_FAST_SWEEP_FAIL_THRESHOLD=2
CONFIG_SENSORARRAY_FDC_ROW_RESCUE_FAIL_COUNT=4
CONFIG_SENSORARRAY_FDC_RESCUE_TASK_STACK=12288
CONFIG_SENSORARRAY_FDC_SAMPLE_DEVICE_LOG_EVERY_N_FRAMES=0
CONFIG_SENSORARRAY_LOG_I2C_STATS_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_LOG_TIMING_STATS_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_TIMING_SUMMARY_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_TIMING_SUMMARY_PERIOD_FRAMES=20
CONFIG_SENSORARRAY_FDC_TIMING_SUMMARY_AGGREGATE=y
CONFIG_SENSORARRAY_FDC_TIMING_OVERRUN_IMMEDIATE_LOG=y
# CONFIG_SENSORARRAY_FDC_TIMING_VERBOSE_PER_FRAME is not set
CONFIG_SENSORARRAY_FDC_PROFILE_LOG_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_READY_LOG_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_TIMING_COMPACT_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_QUALITY_LOG_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_I2C_LOG_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_PROFILE_HIGH_PRECISION=y
# CONFIG_SENSORARRAY_FDC_PROFILE_BALANCED_20FPS is not set
# CONFIG_SENSORARRAY_FDC_PROFILE_FAST_DEBUG is not set
CONFIG_SENSORARRAY_FDC_PRECISION_SAFE_SEQUENCE_ENABLE=y
# CONFIG_SENSORARRAY_FDC_FORMAL_FAST_PROFILE_ENABLE is not set
CONFIG_SENSORARRAY_FDC_FORMAL_FAST_TARGET_ROUND_US=4000
CONFIG_SENSORARRAY_FDC_PROFILE_TOO_SLOW_WARN_US=6250
# CONFIG_SENSORARRAY_FDC_PROFILE_TOO_SLOW_RESCUE_ENABLE is not set
CONFIG_SENSORARRAY_FDC_PFU_LOG_EVERY_N_FRAMES=100
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_SENSORARRAY_FDC_DIAG_DUMP_REGS is not set
CONFIG_SENSORARRAY_FDC_DIAG_DUMP_INTERVAL_MS=5000
CONFIG_SENSORARRAY_FDC_DIAG_DUMP_SKIP_OFFLINE_BUS=y
# CONFIG_TMUX1108_SW_REF_LEVEL is not set
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_42_FEATURES_SUPPORTED is not set
CONFIG_BT_GATT_MAX_SR_PROFILES=3
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=24
# CONFIG_BT_GATTC_ENABLE is not set
# CONFIG_BT_BLE_SMP_ENABLE is not set
CONFIG_BT_ACL_CONNECTIONS=1
CONFIG_BT_BLE_50_EXTEND_ADV_EN=y
CONFIG_BT_BLE_50_PERIODIC_ADV_EN=y
CONFIG_BT_BLE_50_EXTEND_SCAN_EN=y
CONFIG_BT_BLE_50_EXTEND_SYNC_EN=y
CONFIG_BT_BLE_50_DTM_TEST_EN=y
CONFIG_BT_CTRL_DTM_ENABLE=y
CONFIG_BT_CTRL_BLE_MASTER=y
CONFIG_BT_CTRL_BLE_SCAN=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=12
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_SENSORARRAY_ADC_CORE=1
CONFIG_SENSORARRAY_MISC_CORE=0
CONFIG_SENSORARRAY_FDC_PRIMARY_WORKER_CORE=1
CONFIG_SENSORARRAY_FDC_SECONDARY_WORKER_CORE=1
CONFIG_SENSORARRAY_ADS_WORKER_CORE=1
CONFIG_SENSORARRAY_LOG_TASK_CORE=0
CONFIG_SENSORARRAY_OUTPUT_TASK_CORE=0
CONFIG_SENSORARRAY_SERIAL_CTRL_TASK_STACK=6144
CONFIG_SENSORARRAY_BLE_CTRL_TASK_STACK=6144
CONFIG_SENSORARRAY_TRANSPORT_TASK_STACK=6144
CONFIG_SENSORARRAY_NET_TASK_CORE=0
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SENSORARRAY_FDC_PRIMARY_WORKER_TASK_CORE=1
CONFIG_SENSORARRAY_FDC_SECONDARY_WORKER_TASK_CORE=1
CONFIG_SENSORARRAY_SCAN_TASK_CORE=1
CONFIG_SENSORARRAY_COMM_TASK_CORE=0
CONFIG_SENSORARRAY_ADS_GAP_FILL_ENABLE=y
CONFIG_SENSORARRAY_ADS_START_GPIO=48
CONFIG_SENSORARRAY_ADS_DRDY_GPIO=13
CONFIG_BOARD_ADS126X_START_GPIO=48
CONFIG_BOARD_ADS126X_DRDY_GPIO=13
CONFIG_SENSORARRAY_ADS_DATA_RATE=15
CONFIG_SENSORARRAY_ADS_GAP_GUARD_US=500
CONFIG_SENSORARRAY_ADS_JOB_WORST_CASE_US=4000
CONFIG_SENSORARRAY_ADS_DRDY_TIMEOUT_US=600
CONFIG_SENSORARRAY_ADS_AIN8_BATTERY_DIVIDER_NUM=2
CONFIG_SENSORARRAY_ADS_AIN8_BATTERY_DIVIDER_DEN=1
CONFIG_SENSORARRAY_BATTERY_DATA_RATE=9
CONFIG_SENSORARRAY_BATTERY_MAX_SPREAD_RAW=2000000
CONFIG_SENSORARRAY_ADS_AVSS_TO_GND_UV=1800000
CONFIG_SENSORARRAY_ADS_AVDD_TO_GND_UV=3300000
CONFIG_SENSORARRAY_ADS_RAIL_EXPECTED_TOLERANCE_UV=250000
CONFIG_SENSORARRAY_ADS_ZERO_PERIOD_FRAMES=100
CONFIG_SENSORARRAY_ADS_RAIL_PERIOD_FRAMES=500
CONFIG_SENSORARRAY_NET_ENABLE=y
CONFIG_SENSORARRAY_WIFI_SOFTAP_ENABLE=y
CONFIG_SENSORARRAY_BLE_ENABLE=y
CONFIG_SENSORARRAY_BLE_USE_2M_PHY=y
CONFIG_SENSORARRAY_BLE_HIGH_TX_POWER=y
CONFIG_SENSORARRAY_BLE_STATUS_NOTIFY_ENABLE=y
CONFIG_SENSORARRAY_BLE_STATUS_NOTIFY_EVERY_N_FRAMES=50
CONFIG_SENSORARRAY_BLE_CAP_TEXT_EVERY_N_FRAMES=0
CONFIG_SENSORARRAY_TRANSPORT_DEFAULT_STREAM="auto"
# CONFIG_SENSORARRAY_OUTPUT_RATE_LIMIT_ENABLE is not set
